package tech.wetech.admin.modules.system.enums;

public enum GroupType {
    И─│Х╢╖Е▒≤,
    Е▐√Д╩╤Е▒≤,
    Е┬├Г╠╩Е▒≤
    /**
     * 1║╒сц╩╖Userё╨вНжу╡ывВхкт╠ё╛х╗оч╣двНжуйэрФуъё╛©ьжфх╗оч©ьжфх╗очй╣╪йио╬мйг©ьжфсц╩╖╣дх╗очё╛╤Ь╡╩йг╫ги╚╩Руъсц╩╖вИ╣дх╗оч
     * 2║╒сц╩╖вИUserGroupё╨йгоЮ╤т╢╧ж╠╤Ьят╣д║ё╠ххГк╣╡и╧╨╡©уБ╦Жсц╩╖вИй╣╪йиойгси╡и╧╨╡©╣др╣нЯт╠(тщгр╤╗рЕ╤╪н╙сц╩╖)вИЁи╣дё╛╬ъспиооб╪╤╣дцВх╥╧ьо╣ё╩╡и╧╨╡©ж╩дэ╡И©╢йТсз╡и╧╨╡©╣днд╣╣ё╛оЗйш╡©ж╩дэ╡И©╢йТсзоЗйш╡©╣днд╣╣ё╛╢Ьспг©ар╣д╡©це(вИ)птжйё╛╣╚йг╡и╧╨╡©р╣нЯт╠кДх╩╤╪йгйТсзм╛р╩╦Ж╡©цеё╛╣╚йгх╢╡╩р╩╤╗спвеоЮм╛╣дх╗очё╛╠ххГк╣╬╜юМ╨мр╩╟Цр╣нЯт╠╣дх╗оч©о╤╗╢Фтз╡НрЛ
     * 3║╒╫ги╚Roleё╨сц╩╖вИйг╢Ьспр╩жж╢╧ж╠╪хвтио╤Ьоб╣дптжйё╛╤Ь╫ги╚╣д╥╤н╖тРц╩сп╢Ьведгц╢е╗╨Я╣д╢╧ж╠╧ьо╣ё╛╤Ьйг╢Ьсп╠х╫оцВот╣дк╝ф╫(╫╩╡Ф)птжйё╩╠х╥╫к╣ож╤╗рЕр╩╦Ж╫ги╚ё╨╬╜юМё╛уБ╦Ж╬╜юМ╟Э╨╛ак╦В╦Ж╡©це╣д╬╜юМё╛╤Ь╡╩╣╔╣╔йг╡и╧╨╡©╬╜юМ╩РуъйгоЗйш╡©╬╜юМё╛╨эцВотуБ╦Ж║╝╬╜юМ║╞╫ги╚отх╩м╛й╠╬ъсп╦В╡©це╣д╬╜юМ╣дх╗очё╛р╡╬мйгк╣уБй╠╨РхГ╧Ш╦В╡©це╬╜юМцгж╩йг╢╕сз╦ц║╝╬╜юМ║╞╫ги╚ё╛дгц╢╡и╧╨╡©╬╜юМ╡╩╣╚╬ъсп╡и╧╨╡©╬╜юМ╣д╡ывВх╗очё╛м╛й╠р╡╠╩╦ЁсХакфДкШ╦В╡©це╬╜юМ╣дх╗очё╛уБ╦Жй╠╨Р╦В╦Ж╡©це╬╜юМ╣дх╗очйгр╩жб╣дё╛╣╚йгуБяЫйф╠ьтЛЁих╗оч╣дс╣╤б╩Руъ╩Лбрё╛╢кй╠╦у╡елА╣╫╣д╣зр╩╦Ж╤тоСё╨сц╩╖╬меииосцЁ║акё╛╪╦╦Ж╡©це╬╜юМм╛йТсз║╝╬╜юМ║╞╫ги╚гИ©ЖобсжоКкШцгж╝╪Д╣дх╗очспгЬ╠Пё╛дЦж╩дэ╤тц©╦Ж╡©це╬╜юМ(иМ╥щн╙ё╨сц╩╖)╣╔╤юйзх╗акё╛╣╠х╩дЦр╡©ирт╦Ы╬щ╦цсц╩╖иМ╢╕╣дсц╩╖вИ╨м╫ги╚ж╝╪Д╣д╧ьа╙╧ьо╣╩РуъееЁБ╧ьо╣ю╢х╥хосц╩╖╣двНжух╗оч║ё
     */
    //║╓║╓║╓оЮ╠хсц╩╖╫ги╚╧эюМё╛©ирт╢╧ж╠аё╤х╫Ьппсц╩╖╧эюМ
}